[
    {"codigo":1, "foto":"https://www.harpofilm.com/imagenes/a34_98.jpg","titulo":"EL CASTILLO DE CRISTAL","director":"DESTIN DANIEL CRETTON","precio":"20","anio":"2018","stock":"20","descripcion":"Una joven crece en una familia disfuncional de nómadas inconformistas, con una madre excéntrica y un padre alcohólico que distrae a los niños con su imaginación para que ignoren su pobreza. Basada en las memorias de Jeanette Walls."},
    {"codigo":2, "foto":"https://www.harpofilm.com/imagenes/46b_98.jpg","titulo":"LA HORA DEL CAMBIO","director":"SALVATORE FICARRA","precio":"22","anio":"2018","stock":"50","descripcion":"Los vecinos del pequeño pueblo siciliano de Pietrammare viven acostumbrados al caos que conlleva saltarse la ley, pero están hartos. Las carreteras tienen socavones, el tráfico es insufrible, la basura se acumula en las aceras y no hay día que un vecino no pise un excremento de perro. Tampoco les falta un gran puerto... sin barcos, y una fábrica altamente contaminante. Pero parece que ha llegado la hora del cambio: en las elecciones, un nuevo alcalde ha salido victorioso y viene con la firme intención de cumplir todo su programa electoral."},
    {"codigo":3, "foto":"https://www.harpofilm.com/imagenes/243_80.jpg","titulo":"EL ULTIMO TRAJE","director":"PABLO SOLARZ","precio":"18.21","anio":"2018","stock":"45","descripcion":"Narra el viaje de Abraham (Miguel Ángel Solá), un sastre judío de 88 años que decide embarcarse en la aventura de encontrar a un viejo amigo que le salvó hace más de siete décadas de una muerte segura durante el holocausto, hacia el final de la ocupación Nazi."},
    {"codigo":4, "foto":"https://www.harpofilm.com/imagenes/c3a_100.jpg","titulo":"KILO TWO BRAVO","director":"PAUL KATIS","precio":"18.99","anio":"2018","stock":"60","descripcion":"Afganistán. Una pequeña unidad de soldados ingleses instalada en una colina con vistas a la presa Kajaki. Una patrulla de tres hombres se dispone a deshabilitar un control de carretera talibanes. Al caminar por el lecho seco del rio Kajaki uno de ellos pisa una mina anti-persona. Sus compañeros acuden rápidamente en su ayuda para posteriormente darse cuenta de que están atrapados en una zona altamente repleta de estas mortales minas. Cada movimiento que hagan a partir de ese instante les puede costar una pierna o incluso la vida."},
    {"codigo":5, "foto":"https://www.harpofilm.com/imagenes/810_86.jpg","titulo":"EL BEBE JEFAZO","director":"TOM McGRATH","precio":"18.77","anio":"2017","stock":"30","descripcion":"La llegada de un hermanito trastoca por completo la idílica vida del pequeño Tim, hasta entonces hijo único de 7 años y el ojito derecho de sus padres. Su nuevo hermano es un peculiar bebé, que viste traje y corbata y lleva maletín. Tim comienza a sospechar de él, hasta que descubre que puede hablar."},
    {"codigo":6, "foto":"https://www.harpofilm.com/imagenes/ec5_98.jpg","titulo":"LOGAN","director":"JAMES MANGOLD","precio":"30","anio":"2017","stock":"22","descripcion":"Sin sus poderes, por primera vez, Wolverine es verdaderamente vulnerable. Después de una vida de dolor y angustia, sin rumbo y perdido en el mundo donde los X-Men son leyenda, su mentor Charles Xavier lo convence de asumir una última misión: proteger a una joven que será la única esperanza para la raza mutante... Tercera y última película protagonizada por Hugh Jackman en el papel de Lobezno."},
    {"codigo":7, "foto":"https://www.harpofilm.com/imagenes/c9c_100.jpg","titulo":"TRANSFORMERS EL ULTIMO CABALLERO","director":"MICHAEL BAY","precio":"17.99","anio":"2017","stock":"35","descripcion":"Dos especies en guerra: una de carne y hueso, la otra de metal. El Último Caballero rompe con el mito original de la franquicia de Transformers y redefine lo que significa ser un héroe. Humanos y Transformers están en guerra y Optimus Prime se ha ido. La llave para salvar nuestro futuro está enterrada en los secretos del pasado, en la historia oculta de los Transformers en la Tierra. Salvar a nuestro mundo está en manos de una alianza única: Cade Yeager (Mark Wahlberg); Bumblebee; un Lord Inglés (Sir Anthony Hopkins); y una profesora de la Universidad de Oxford (Laura Haddock). Hay un momento en la vida de todo ser humano en la que recibimos el llamado para hacer la diferencia. En Transformers: El Último Caballero los perseguidos se convertirán en héroes; los héroes se convertirán en villanos y sólo un mundo sobrevivirá: el de ellos o el nuestro. Quinta película de Transformers dirigida por Michael Bay."},
    {"codigo":8, "foto":"https://www.harpofilm.com/imagenes/e04_89.jpg","titulo":"NOCHE DE VENGANZA","director":"BARAN BO ODAR","precio":"15.50","anio":"2017","stock":"11","descripcion":"Vincent Downs (Fox) es un agente que se encuentra en medio de una red de policías corruptos implicados con el control de un casino. Cuando un atraco sale mal, un grupo de criminales secuestra al hijo adolescente de Vincent. En sólo una noche, él debe salvar a su hijo, evadir una investigación interna de la propia policía y llevar a los secuestradores ante la justicia... Remake del film francés de 2011 Nuit blanche."},
    {"codigo":9, "foto":"https://www.harpofilm.com/imagenes/ba7_98.jpg","titulo":"REDENCION","director":"ANTOINE FUQUA","precio":"13.75","anio":"2017","stock":"24","descripcion":"Pese a haber gozado de gloria y de premios en su pasado, un luchador (Jake Gyllenhaal) ha caído en desgracia. Sin embargo, no se rinde y toma la decisión de mejorar su imagen por el bien de su mujer (Rachel McAdams) y su hija."},
    {"codigo":10, "foto":"https://www.harpofilm.com/imagenes/a29_100.jpg","titulo":"ESCANDALO EN EL PODER","director":"AUSTIN STARK","precio":"19.99","anio":"2016","stock":"15","descripcion":"Tras el terrible vertido de un petrolero de BP en las costas de Louisiana en el año 2010, un congresista (Nicolas Cage) que estaba muy decidido a ir contra la empresa británica se ve de repente involucrado en un escándalo sexual."},
    {"codigo":11, "foto":"https://www.harpofilm.com/imagenes/a01_94.jpg","titulo":"LOS 33 UNA HISTORIA DE ESPERANZA","director":"PATRICIA RIGGEN","precio":"23.50","anio":"2016","stock":"30","descripcion":"Narra los sucesos reales que ocurrieron en Chile en agosto del 2010, cuando el derrumbe de la mina San José dejó atrapados a 33 mineros a unos 720 metros de profundidad durante 70 días."},
    {"codigo":12, "foto":"https://www.harpofilm.com/imagenes/761_91.jpg","titulo":"MAREA NEGRA","director":"PETER BERG","precio":"12.40","anio":"2017","stock":"47","descripcion":"Basado en los eventos sucedidos en el Golfo de México en abril del 2010, cuando un accidente en un oleoducto causó una catástrofe que mató a 11 personas e hirió a otras 16, provocando además una de las catástrofes medioambientales más graves causadas por el hombre."},
    {"codigo":13, "foto":"https://www.harpofilm.com/imagenes/1d5_78.jpg","titulo":"ROBIN HOOD","director":"RIDLEY SCOTT","precio":"11.50","anio":"2010","stock":"25","descripcion":"Inglaterra, siglo XIII. Robin Longstride (Russell Crowe), un magnífico arquero al servicio del rey Ricardo Corazón de León (Danny Huston), vuelve de las cruzadas en tierra santa saqueando poblados mientras lucha contra las tropas francesas."},
    {"codigo":14, "foto":"https://www.harpofilm.com/imagenes/24d_24.jpg","titulo":"PERCY JACKSON Y EL LADRON DEL RA","director":"CHRIS COLUMBUS","precio":"13.99","anio":"2010","stock":"31","descripcion":"Adaptación de la novela publicada en España con el título de El Ladrón del Rayo. La novela trata la historia de un chico aparentemente normal (Lerman) que, tras acudir a un campamento, descubre que es hijo del dios de los mares, Poseidón, y que su mejor amigo Grover (Jackson) es un sátiro."},
    {"codigo":15, "foto":"https://www.harpofilm.com/imagenes/623_49.jpg","titulo":"MALDITOS BASTARDOS","director":"QUENTIN TARANTINO","precio":"17.99","anio":"2010","stock":"21","descripcion":"En otro lugar de Europa, el teniente Aldo Raine (Brad Pitt) organiza un grupo de soldados judíos para tomar represalias contra objetivos concretos."}

]